#### lecture14

In [2]:
import pandas as pd
from pandas import Series

In [3]:
obj = Series([3,6,9,12])
obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
obj.values

array([ 3,  6,  9, 12], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
ww2_cas = Series([8700000, 4300000, 3000000, 2100000,400000], index=['USSR','Germany','China','Japan','USA'])
ww2_cas

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [8]:
ww2_cas['USA']

400000

In [9]:
ww2_cas[ww2_cas>4000000]

USSR       8700000
Germany    4300000
dtype: int64

In [10]:
ww2_cas>4000000

USSR        True
Germany     True
China      False
Japan      False
USA        False
dtype: bool

In [12]:
'USSR' in ww2_cas # like Dist

True

In [14]:
ww2_dict = ww2_cas.to_dict() # extract Dist
ww2_dict

{'China': 3000000,
 'Germany': 4300000,
 'Japan': 2100000,
 'USA': 400000,
 'USSR': 8700000}

In [15]:
ww2_Series = Series(ww2_dict) # construct Series from Dict
ww2_Series

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64

In [18]:
countries = ['China','Germany', 'Japan', 'USA', 'USSR', 'Argentina']
obj2 = Series(ww2_dict, index = countries) # set index explicitlly
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [19]:
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [20]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [21]:
print(ww2_Series)
print(obj2)

China      3000000
Germany    4300000
Japan      2100000
USA         400000
USSR       8700000
dtype: int64
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [22]:
ww2_Series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [23]:
obj2.name = '第二次世界大戦の死傷者' # set total title
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: 第二次世界大戦の死傷者, dtype: float64

In [24]:
obj2.index.name = 'Countries' # set name to index
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: 第二次世界大戦の死傷者, dtype: float64

#### lecture15

In [2]:
import pandas as pd
from pandas import DataFrame # to be need not write class prefix

#### easiest way of creating dataframe

In [6]:
nfl_frame = pd.read_clipboard()
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East

In [7]:
nfl_frame.columns

Index(['Rank ', 'Team ', 'Won ', 'Lost ', 'Tied ', 'Pct. ',
       'First NFL Season ', 'Total Games ', 'Division'],
      dtype='object')

In [17]:
nfl_frame['First NFL Season ']

0    1960
1    1921
2    1920
3    1966
4    1960
5    1925
Name: First NFL Season , dtype: int64

because columns labels include white space

In [21]:
nfl_frame[['Team ', 'First NFL Season ']]

                   Team   First NFL Season
0        Dallas Cowboys                1960
1     Green Bay Packers                1921
2         Chicago Bears                1920
3        Miami Dolphins                1966
4  New England Patriots                1960
5       New York Giants                1925

In [23]:
DataFrame(nfl_frame, columns=['Team ', 'First NFL Season '])
# this DataFrame reference src data

                   Team   First NFL Season
0        Dallas Cowboys                1960
1     Green Bay Packers                1921
2         Chicago Bears                1920
3        Miami Dolphins                1966
4  New England Patriots                1960
5       New York Giants                1925

In [24]:
DataFrame(nfl_frame, columns=['Team ', 'First NFL Season ', 'Stadium'])

                   Team   First NFL Season   Stadium
0        Dallas Cowboys                1960      NaN
1     Green Bay Packers                1921      NaN
2         Chicago Bears                1920      NaN
3        Miami Dolphins                1966      NaN
4  New England Patriots                1960      NaN
5       New York Giants                1925      NaN

In [25]:
nfl_frame.head(3)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North

In [27]:
nfl_frame.tail(3)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East

In [29]:
nfl_frame.ix[3]

Rank                               4
Team                 Miami Dolphins
Won                              439
Lost                             341
Tied                               4
Pct.                           0.563
First NFL Season                1966
Total Games                     784
Division                    AFC East
Name: 3, dtype: object

In [31]:
nfl_frame['Stadinum'] = "Levi's Stadium"
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadinum
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,Levi's Stadium
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Levi's Stadium
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Levi's Stadium
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Levi's Stadium
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,Levi's Stadium
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,Levi's Stadium

In [33]:
import numpy as np
nfl_frame['Stadium'] = np.arange(6)
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadinum,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,Levi's Stadium,0
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Levi's Stadium,1
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Levi's Stadium,2
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Levi's Stadium,3
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,Levi's Stadium,4
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,Levi's Stadium,5

In [37]:
stadiums = pd.Series(["Levi's stadium", 'AT&T Stadium'], index=[4,0])
stadiums

4    Levi's stadium
0      AT&T Stadium
dtype: object

In [38]:
nfl_frame['Stadium'] = stadiums
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadinum,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,Levi's Stadium,AT&T Stadium
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Levi's Stadium,NaN
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Levi's Stadium,NaN
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Levi's Stadium,NaN
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,Levi's Stadium,Levi's stadium
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,Levi's Stadium,NaN

In [40]:
del nfl_frame['Stadium']

KeyError: 'Stadium'

In [41]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadinum
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,Levi's Stadium
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Levi's Stadium
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Levi's Stadium
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Levi's Stadium
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,Levi's Stadium
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,Levi's Stadium

In [42]:
data = {'City':['SF','LA','NYC'], 'Population':[837000, 3880000, 84000000]}
# create DataFrame from Dist

In [43]:
data

{'City': ['SF', 'LA', 'NYC'], 'Population': [837000, 3880000, 84000000]}

In [44]:
city_frame = DataFrame(data)
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC    84000000

we can see reference of pandas by jupyter Help in jupyter menu bar

#### lecture16

In [46]:
my_ser = pd.Series([1,2,3,4], index=['A', 'B', 'C','D'])
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [47]:
my_index = my_ser.index
print(my_index[0])
print(my_index[2])
print(my_index[2:])

A
C
Index(['C', 'D'], dtype='object')

In [48]:
my_index[0] = 'Z' # basically can't modify

TypeError: Index does not support mutable operations

#### lecture17 chaging index

In [50]:
from numpy.random import randn

In [53]:
ser1 = pd.Series([1,2,3,4], index = ['A', 'B', 'C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [54]:
ser2 = ser1.reindex(['A', 'B', 'C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [56]:
ser2.reindex(['A', 'B', 'C','D','E','F','G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [57]:
ser3 = pd.Series(['USA','Mexico','Canada'], index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [59]:
ser3.reindex(range(15),method='ffill') # ffill is forward fill

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [60]:
dframe = pd.DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'], columns=['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A  0.861469 -1.326135 -0.429064 -0.227178 -1.192161
B  1.405762  0.874484 -0.567135  0.656880  1.180589
D -1.372436  1.097580 -1.075471 -1.857877 -0.434337
E  1.234438  0.575374  0.390548 -0.560447 -1.467738
F -0.539103 -0.516461 -1.294111  0.049334  0.069326

In [61]:
new_index = ['A','B','C','D','E','F']
dframe2 = dframe.reindex(new_index)
dframe2

       col1      col2      col3      col4      col5
A  0.861469 -1.326135 -0.429064 -0.227178 -1.192161
B  1.405762  0.874484 -0.567135  0.656880  1.180589
C       NaN       NaN       NaN       NaN       NaN
D -1.372436  1.097580 -1.075471 -1.857877 -0.434337
E  1.234438  0.575374  0.390548 -0.560447 -1.467738
F -0.539103 -0.516461 -1.294111  0.049334  0.069326

In [62]:
new_columns = ['col1','col2','col3','col4','col5','col6']
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  0.861469 -1.326135 -0.429064 -0.227178 -1.192161   NaN
B  1.405762  0.874484 -0.567135  0.656880  1.180589   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.372436  1.097580 -1.075471 -1.857877 -0.434337   NaN
E  1.234438  0.575374  0.390548 -0.560447 -1.467738   NaN
F -0.539103 -0.516461 -1.294111  0.049334  0.069326   NaN

In [64]:
dframe.ix[new_index,new_columns]

       col1      col2      col3      col4      col5  col6
A  0.861469 -1.326135 -0.429064 -0.227178 -1.192161   NaN
B  1.405762  0.874484 -0.567135  0.656880  1.180589   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.372436  1.097580 -1.075471 -1.857877 -0.434337   NaN
E  1.234438  0.575374  0.390548 -0.560447 -1.467738   NaN
F -0.539103 -0.516461 -1.294111  0.049334  0.069326   NaN

#### lecture18

In [65]:
ser1 = pd.Series(np.arange(3), index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [66]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [68]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), index=['SF','LA','NY'], columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [69]:
dframe1.drop('LA') # axis=0:default value

    pop  size  year
SF    0     1     2
NY    6     7     8

In [70]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [71]:
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

#### lecture19

In [72]:
ser1 = pd.Series(np.arange(3),index=['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int32

In [74]:
ser1['B'] # access by index

2

In [76]:
ser1[2] # access by index value

4

In [77]:
ser1[0:3] # get values by set slice range

A    0
B    2
C    4
dtype: int32

In [78]:
ser1[['A','B']] # get values by set List

A    0
B    2
dtype: int32

In [79]:
ser1[ser1>3] # get values by set condition

C    4
dtype: int32

In [81]:
ser1[ser1>3] = 10 # set value to match condition position
ser1

A     0
B     2
C    10
dtype: int32

In [82]:
dframe = pd.DataFrame(np.arange(25).reshape((5,5)), index=['NYC','LA','SF','DC','Chi'], columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [83]:
dframe['B'] # same way Series

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [84]:
dframe[['B','C']]

      B   C
NYC   1   2
LA    6   7
SF   11  12
DC   16  17
Chi  21  22

In [85]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [86]:
dframe>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [87]:
ser1>3

A    False
B    False
C     True
dtype: bool

In [89]:
dframe.ix['LA'] # axis=0

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [91]:
dframe.ix[1] # access by index value

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

#### lecture20

In [92]:
ser1 = pd.Series([0,1,2],index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [93]:
ser2 = pd.Series([3,4,5,6], index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [94]:
ser1+ser2 # NaN is Not a Number

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [95]:
dframe1 = pd.DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'), index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [96]:
dframe2 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'), index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [97]:
dframe1 + dframe2 # only add in exist common position(AND)

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [98]:
dframe1.add(dframe2, fill_value=0) # OR

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [100]:
print(dframe2)

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [101]:
ser3 = dframe2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [102]:
dframe2 - ser3 # calc per row

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

#### lecture21

In [103]:
ser1 = pd.Series(range(3), index=['C','A','B'])
ser1

C    0
A    1
B    2
dtype: int32

In [104]:
ser1.sort_index()

A    1
B    2
C    0
dtype: int32

In [105]:
ser1.order() # order by value

C:\Users\Seno\Anaconda3\py36\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

C    0
A    1
B    2
dtype: int32

In [107]:
ser2 = pd.Series(randn(10))
ser2

0    1.388747
1    0.273001
2    0.735470
3   -0.888203
4   -0.477707
5    0.958311
6   -0.422323
7    0.186365
8    0.358146
9    1.134443
dtype: float64

In [108]:
ser2.rank() # show order value compare

0    10.0
1     5.0
2     7.0
3     1.0
4     2.0
5     8.0
6     3.0
7     4.0
8     6.0
9     9.0
dtype: float64

In [109]:
ser2.sort()

C:\Users\Seno\Anaconda3\py36\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: sort is deprecated, use sort_values(inplace=True) for INPLACE sorting
  if __name__ == '__main__':

In [110]:
ser2

3   -0.888203
4   -0.477707
6   -0.422323
7    0.186365
1    0.273001
8    0.358146
2    0.735470
5    0.958311
9    1.134443
0    1.388747
dtype: float64

In [111]:
ser2.rank()

3     1.0
4     2.0
6     3.0
7     4.0
1     5.0
8     6.0
2     7.0
5     8.0
9     9.0
0    10.0
dtype: float64

#### lecture22

In [113]:
arr = np.array([[1,2,np.nan],[np.nan,3,4]])
arr

array([[  1.,   2.,  nan],
       [ nan,   3.,   4.]])

In [114]:
dframe1 = pd.DataFrame(arr, index=['A','B'],columns=['One','Two','Three'])
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [118]:
dframe1.sum() # sum of columns. ignore NaN

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [116]:
dframe1.sum(axis=1) # sum of rows

A    3.0
B    7.0
dtype: float64

In [119]:
dframe1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [121]:
dframe1.idxmin() # get position of min values

One      A
Two      A
Three    B
dtype: object

In [122]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [123]:
dframe1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [125]:
dframe1.describe() # basic statistics summary

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [4]:
# import pandas.io.data as pdweb
from pandas_datareader import data, wb
import datatime

ModuleNotFoundError: No module named 'pandas_datareader'

In [5]:
import pandas_datareader

ModuleNotFoundError: No module named 'pandas_datareader'